//
//  ThemeContent.swift
//  FirstApp
//
//  Created by Liza Likhomanova on 10.12.2022.
//

import Foundation

struct ThemeContent {
    
    static let phasesOfMoon = ["🌚", "🌕", "🌖", "🌗",
                               "🌑", "🌒", "🌓", "🌔"].shuffled()
    
    static let hearts = ["❤️", "🧡", "💛", "💚",
                         "💙", "💜", "🖤", "🤍",
                         "🤎", "💔", "❤️‍🔥", "❤️‍🩹",
                         "💖", "💝", "💘", "💞"].shuffled()
    
    static let animals = ["🦊", "🐼", "🐷", "🐻",
                          "🐶", "🐱", "🐭", "🐹",
                          "🐰", "🐻‍❄️", "🐨", "🐯",
                          "🦁", "🐮", "🐸", "🐥",
                          "🐔", "🐧", "🦄", "🦉"].shuffled()
    
    static let clouds = ["⛅️", "🌥️", "☁️", "🌦️",
                         "🌧️", "⛈️", "🌩️", "🌨️"].shuffled()
    
    static let fruits = ["🍏", "🍎", "🍐", "🍊",
                         "🍋", "🍌", "🍉", "🍑",
                         "🍓", "🍇", "🥝", "🍍"].shuffled()
    
    static let zodiacSigns = ["♈️", "♉️", "♊️", "♋️",
                              "♌️", "♍️", "♎️", "♏️",
                              "♐️", "♑️", "♒️", "♓️"].shuffled()
}
